{"data":{"contentfulAbout":{"aboutMe":{"childMarkdownRemark":{"rawMarkdownBody":"## Software Engineering Summer Analyst, J.P.Morgan\n*Jun 2020 - Aug 2020 | Singapore*  \n\n## Research Assistant in Computer Vision, National University of Singapore\n*Feb 2019 - Oct 2019 | Singapore*  \n- Selected as one out of 40 undergraduates to assist in data processing and annotating Tasty Videos dataset, a collection of 4000 recipes for zero-shot learning, recognition and anticipation.\n- Design and develop downloadable dataset websites for multiple soon to be published research studies in Computer Vision.\n- Process videos and images for data analysis purposes using OpenPose, a real-time multi-person key point detection library for body, face, hand and foot estimation.\n\n## Freelance Web Application Developer, GoldSilver Central Pte. Ltd.\n*Jun 2019 - Jul 2019 | Singapore*  \n- Collaborated as a pair to develop and design a full-stack storage viewing web application with back-end admin panel using MERN framework (MongoDB, Express.js, React.js, Node.js).\n\n## Web Application Developer Intern, Cudy Pte. Ltd.\n*Sep 2017 - Oct 2017 | Singapore*\n- Collaborated with development team to design, create and develop a front-end system in Angular 4 for a live streaming EdTech web platform\n\n## Marketing and Communications Intern, Science Centre Singapore\n*Apr 2017 - Aug 2017 | Singapore*\n- Assisted in overseeing the redevelopment of the corporate website, media previews and large-scale events.\n- Evaluated over 15 proposals sent in by web development vendors for approval by the board.\n- Conducted market research on website demographics and proposed suggestions on continuous improvement initiatives to board."}},"profile":{"title":"Harry","image":{"src":"//images.ctfassets.net/lxijw6qkp0cz/6nf3rNaaVaUqYcoAcciSeC/e5784939475c5edeb34a05f87ff0268b/IMG_2220.JPG?w=450&fl=progressive&q=100"}},"aboutMeEdu":{"childMarkdownRemark":{"rawMarkdownBody":"## National University of Singapore\n*Aug 2018 - Expected May 2021*  \nBachelor of Computing in Computer Science\n"}}}}}